SELECT Н_УЧЕНИКИ.ИД AS НОМЕР,ФАМИЛИЯ,ИМЯ,ОТЧЕСТВО,AVG(Н_ОЦЕНКИ.СОРТ)AS Ср_оценка
FROM Н_ЛЮДИ
INNER JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
INNER JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
INNER JOIN Н_ОЦЕНКИ ON Н_ВЕДОМОСТИ.ОЦЕНКА = Н_ОЦЕНКИ.КОД 
WHERE ГРУППА = '4100' AND Н_ОЦЕНКИ.СОРТ < 5
GROUP BY НОМЕР,ФАМИЛИЯ,ИМЯ,ОТЧЕСТВО
HAVING AVG(Н_ОЦЕНКИ.СОРТ) > (
       SELECT AVG(Н_ОЦЕНКИ.СОРТ)AS Ср_оценка
				FROM Н_ЛЮДИ
				INNER JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
				INNER JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
				INNER JOIN Н_ОЦЕНКИ ON Н_ВЕДОМОСТИ.ОЦЕНКА = Н_ОЦЕНКИ.КОД 
				WHERE ГРУППА = '3100' AND Н_ОЦЕНКИ.СОРТ < 5
);
