WITH СР_ОЦЕНКА_3100 AS (
     SELECT AVG(Н_ВЕДОМОСТИ.ОЦЕНКА::INTEGER)
        FROM Н_ВЕДОМОСТИ
        JOIN Н_УЧЕНИКИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
             AND Н_УЧЕНИКИ.ГРУППА = '3100'
        WHERE Н_ВЕДОМОСТИ.ОЦЕНКА IN ('2', '3', '4', '5', '99'))

 SELECT Н_ЛЮДИ.ИД AS Номер,ФАМИЛИЯ,
        AVG(Н_ВЕДОМОСТИ.ОЦЕНКА::INTEGER) AS Ср_оценка
       FROM Н_ЛЮДИ
       JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
       AND Н_ВЕДОМОСТИ.ОЦЕНКА IN ('2', '3', '4', '5', '99')
     JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
        AND Н_УЧЕНИКИ.ГРУППА = '4100'
    GROUP BY Н_ЛЮДИ.ИД, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО
   HAVING AVG(Н_ВЕДОМОСТИ.ОЦЕНКА::INTEGER) < (SELECT * FROM СР_ОЦЕНКА_3100);
	
