-- Выведите таблицу со средними оценками студентов группы 4100 (Номер, ФИО, Ср_оценка),
-- у которых средняя оценка равна средней оценк(е|и) в группе 3100.
SELECT "Н_УЧЕНИКИ"."ИД",
       "Н_ЛЮДИ"."ФАМИЛИЯ",
       "Н_ЛЮДИ"."ИМЯ",
       "Н_ЛЮДИ"."ОТЧЕСТВО",
       ROUND(AVG(CAST("Н_ВЕДОМОСТИ"."ОЦЕНКА" AS INT)), 2) AS "СР_ОЦЕНКА"
FROM "Н_УЧЕНИКИ"
         INNER JOIN "Н_ЛЮДИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
         LEFT JOIN "Н_ВЕДОМОСТИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
WHERE "Н_УЧЕНИКИ"."ГРУППА" = '4120' AND "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[2-5]$'
GROUP BY "Н_УЧЕНИКИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО"
HAVING ROUND(AVG(CAST("Н_ВЕДОМОСТИ"."ОЦЕНКА" AS INT)), 2) =
       ROUND((SELECT AVG(CAST("Н_ВЕДОМОСТИ"."ОЦЕНКА" AS INT))
              FROM "Н_УЧЕНИКИ"
                       INNER JOIN "Н_ВЕДОМОСТИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
              WHERE "Н_УЧЕНИКИ"."ГРУППА" = '3100'
                AND "Н_ВЕДОМОСТИ"."ОЦЕНКА" ~ '^[2-5]$'), 2);